[Rainmeter]
Update=-1
AccurateText=0
DynamicWindowSize=0
Group=ToggleByAssistBtn

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|一个特别的，有装饰线的按钮。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.10.0

[Variables]
@Include1=#@#GlobalVars.inc

[BtnDecoM1]
Meter=Image
MeasureName=MMBtnDecoShadow


;"任务？我去我去！"
[BtnDeco]
Meter=Image
MeterStyle=styColor1 | BtnAni
X=#MissionX#
Y=(#MissionY#+4)
W=310
H=150
LeftMouseUpAction=#RelsAct##BtnDecoAction#

[BtnDecoDots]
Meter=Image
MeterStyle=BtnDeco
ImageName=#@#Images\BtnDot.png
LeftMouseUpAction=

[BtnDeco_BL]
Meter=Image
MeterStyle=BtnDeco
Group=aniBkLayer
LeftMouseUpAction=

[BtnDecoIcon]
Meter=Image
ImageName=#BtnDecoIcon#
ImageTint=#PrimaryIconTint#
X=([BtnDeco:X]+180)
Y=([BtnDeco:H]*0.08+[BtnDeco:Y])
W=([BtnDeco:H]*0.84)
H=([BtnDeco:H]*0.84)

[BtnDecoTitle]
Meter=String
MeterStyle=styFontTitle
FontSize=50
Text=#BtnDecoTitle#
X=([BtnDeco:X]+4)
Y=([BtnDeco:Y]+62)

[BtnDecoDecoLine]
Meter=Shape
Shape=Line ([BtnDeco:W]*0.12),0,([BtnDeco:W]*0.88),0 | Stroke Color #AccentColor#,235 | StrokeWidth 8
X=[BtnDeco:X]
Y=[BtnDeco:Y]